# SQL Practice Problems: 57 beginning, intermediate, and advanced challenges for you to solve using a “learn-by-doing” approach

- This notebook contains my solution for SQL practice problems from [SPP 57 book](https://www.amazon.com/SQL-Practice-Problems-learn-doing-ebook/dp/B01N41VQFO)

# Connecting to MS SQL DB

In [7]:
import pyodbc
import pandas as pd
import os

In [8]:
class db_connection:
    def __new__(self):
        if not hasattr(self,'instance'):
            self.instance = super(db_connection, self).__new__(self)
            self.conn = pyodbc.connect('Driver={SQL Server};'
                      f'Server={os.environ["MSSQL_SERVER"]};'
                      'Database=Northwind_SPP;'
                      'Trusted_Connection=yes;')
        return self.instance
    
    def get_conn(self):
        return self.conn

## Execute query using cursor object

In [3]:
connection = db_connection()
conn = connection.get_conn()
cursor = conn.cursor()
cursor.execute("""
    SELECT * FROM shippers
""")

for row in cursor:
    print(row)

(1, 'Speedy Express', '(503) 555-9831')
(2, 'United Package', '(503) 555-3199')
(3, 'Federal Shipping', '(503) 555-9931')

## Execute query using pd.read_sql_query()

In [4]:
sql_query = pd.read_sql_query('SELECT * FROM shippers', conn)
print(sql_query)
print(type(sql_query))

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931
<class 'pandas.core.frame.DataFrame'>

- Query result in pandas dataframe looks better, so I'm going to use this approach to execute query and validate result
- Let's make a helper function to execute sql query and print result in pandas data frame

In [9]:
def sql(query : str)->None:
    """
    Take query as an argument, execute it and print the query result
    
    Arguments:
    query -> string type. Query to execute
    """
    result = pd.read_sql_query(query, db_connection().get_conn())
    print(result)

In [6]:
sql("""SELECT * FROM shippers""")

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

# DB Diagram for Practice Database
![ERD](ERD.PNG)

# Introductory Problems
## 1. Which shippers do we have?

In [7]:
sql("""
    SELECT * FROM shippers
""")

   ShipperID       CompanyName           Phone
0          1    Speedy Express  (503) 555-9831
1          2    United Package  (503) 555-3199
2          3  Federal Shipping  (503) 555-9931

## 2. Certain fields from categories

In [8]:
sql("""
    SELECT CategoryName, Description FROM Categories
""")

     CategoryName                                        Description
0       Beverages        Soft drinks, coffees, teas, beers, and ales
1      Condiments  Sweet and savory sauces, relishes, spreads, an...
2     Confections                Desserts, candies, and sweet breads
3  Dairy Products                                            Cheeses
4  Grains/Cereals                Breads, crackers, pasta, and cereal
5    Meat/Poultry                                     Prepared meats
6         Produce                          Dried fruit and bean curd
7         Seafood                                   Seaweed and fish

## 3. Sales Representatives

In [6]:
sql("""
    SELECT FirstName, LastName, HireDate FROM Employees
    WHERE Title = 'Sales Representative'
""")

  FirstName   LastName   HireDate
0     Nancy    Davolio 2010-05-01
1     Janet  Leverling 2010-04-01
2  Margaret    Peacock 2011-05-03
3   Michael     Suyama 2011-10-17
4    Robert       King 2012-01-02
5      Anne  Dodsworth 2012-11-15

## 4. Sales Representatives in the United States

In [11]:
sql("""SELECT DISTINCT Country FROM Employees""")

  Country
0      UK
1     USA

In [12]:
sql("""
    SELECT FirstName, LastName, HireDate From Employees
    WHERE Title = 'Sales Representative' and Country = 'USA'
""")

  FirstName   LastName   HireDate
0     Nancy    Davolio 2010-05-01
1     Janet  Leverling 2010-04-01
2  Margaret    Peacock 2011-05-03

## 5. Orders Placed by Specific Employee ID

In [13]:
sql("""
    SELECT OrderID, OrderDate FROM Orders
    WHERE EmployeeID = 5
""")

    OrderID           OrderDate
0     10248 2014-07-04 08:00:00
1     10254 2014-07-11 02:00:00
2     10269 2014-07-31 00:00:00
3     10297 2014-09-04 21:00:00
4     10320 2014-10-03 12:00:00
5     10333 2014-10-18 18:00:00
6     10358 2014-11-20 05:00:00
7     10359 2014-11-21 14:00:00
8     10372 2014-12-04 10:00:00
9     10378 2014-12-10 00:00:00
10    10397 2014-12-27 17:00:00
11    10463 2015-03-04 13:00:00
12    10474 2015-03-13 16:00:00
13    10477 2015-03-17 02:00:00
14    10529 2015-05-07 01:00:00
15    10549 2015-05-27 03:00:00
16    10569 2015-06-16 15:00:00
17    10575 2015-06-20 22:00:00
18    10607 2015-07-22 09:00:00
19    10648 2015-08-28 22:00:00
20    10649 2015-08-28 00:00:00
21    10650 2015-08-29 06:00:00
22    10654 2015-09-02 07:00:00
23    10675 2015-09-19 06:00:00
24    10711 2015-10-21 03:00:00
25    10714 2015-10-22 03:00:00
26    10721 2015-10-29 08:00:00
27    10730 2015-11-05 07:00:00
28    10761 2015-12-02 08:00:00
29    10812 2016-01-02 02:00:00
30    10823 2016-01-09 17:00:00
31    10841 2016-01-20 21:00:00
32    10851 2016-01-26 00:00:00
33    10866 2016-02-03 01:00:00
34    10869 2016-02-04 09:00:00
35    10870 2016-02-04 12:00:00
36    10872 2016-02-05 06:00:00
37    10874 2016-02-06 14:00:00
38    10899 2016-02-20 09:00:00
39    10922 2016-03-03 02:00:00
40    10954 2016-03-17 16:00:00
41    11043 2016-04-22 17:00:00

## 6. Suppliers and ContactTitles

In [14]:
sql("""
    SELECT SupplierID, ContactName, ContactTitle
    FROM Suppliers
    WHERE ContactTitle != 'Marketing Manager'
""")

    SupplierID                 ContactName                  ContactTitle
0            1            Charlotte Cooper            Purchasing Manager
1            2               Shelley Burke           Order Administrator
2            3               Regina Murphy          Sales Representative
3            5  Antonio del Valle Saavedra          Export Administrator
4            6                 Mayumi Ohno      Marketing Representative
5            8                Peter Wilson          Sales Representative
6            9               Lars Peterson                   Sales Agent
7           11               Petra Winkler                 Sales Manager
8           12                 Martin Bein  International Marketing Mgr.
9           13               Sven Petersen   Coordinator Foreign Markets
10          14                  Elio Rossi          Sales Representative
11          16               Cheryl Saylor         Regional Account Rep.
12          17               Michael Björn          Sales Representative
13          18              Guylène Nodier                 Sales Manager
14          19               Robb Merchant       Wholesale Account Agent
15          20                Chandra Leka                         Owner
16          21              Niels Petersen                 Sales Manager
17          22                 Dirk Luchte            Accounting Manager
18          23              Anne Heikkonen               Product Manager
19          24             Wendy Mackenzie          Sales Representative
20          26            Giovanni Giudici           Order Administrator
21          27              Marie Delamare                 Sales Manager
22          28                  Eliane Noz          Sales Representative
23          29              Chantal Goulet            Accounting Manager

## 7. Products with "queso" in ProductName

In [20]:
sql("""
    SELECT ProductID, ProductName
    FROM Products
    WHERE LOWER(ProductName) LIKE '%queso%'
""")

   ProductID                ProductName
0         11             Queso Cabrales
1         12  Queso Manchego La Pastora

## 8. Orders Shipping to France or Belgium

In [22]:
sql("""
    SELECT OrderID, CustomerID, ShipCountry
    FROM Orders
    WHERE ShipCountry in ('France', 'Belgium')
""")

    OrderID CustomerID ShipCountry
0     10248      VINET      France
1     10251      VICTE      France
2     10252      SUPRD     Belgium
3     10265      BLONP      France
4     10274      VINET      France
..      ...        ...         ...
91    11035      SUPRD     Belgium
92    11038      SUPRD     Belgium
93    11043      SPECD      France
94    11051      LAMAI      France
95    11076      BONAP      France

[96 rows x 3 columns]

## 9. Order Shipping to Any Country in Latin America

- Since there's no list of Latin American countries, we're going to just use the list of Latin American countries that happen to be in the Orders table 
    - Brazil
    - Mexico
    - Argentina
    - Venezuela

In [23]:
sql("""
    SELECT OrderID, CustomerID, ShipCountry
    FROM Orders
    WHERE ShipCountry IN ('Brazil', 'Mexico', 'Argentina', 'Venezuela')
""")

     OrderID CustomerID ShipCountry
0      10250      HANAR      Brazil
1      10253      HANAR      Brazil
2      10256      WELLI      Brazil
3      10257      HILAA   Venezuela
4      10259      CENTC      Mexico
..       ...        ...         ...
168    11065      LILAS   Venezuela
169    11068      QUEEN      Brazil
170    11069      TORTU      Mexico
171    11071      LILAS   Venezuela
172    11073      PERIC      Mexico

[173 rows x 3 columns]

## 10. Employees, in Order of Age

In [28]:
sql("""
    SELECT FirstName, LastName, Title, BirthDate
    FROM Employees
    ORDER BY BirthDate 
""")

  FirstName   LastName                     Title  BirthDate
0  Margaret    Peacock      Sales Representative 1955-09-19
1     Nancy    Davolio      Sales Representative 1966-12-08
2    Andrew     Fuller     Vice President, Sales 1970-02-19
3    Steven   Buchanan             Sales Manager 1973-03-04
4     Laura   Callahan  Inside Sales Coordinator 1976-01-09
5    Robert       King      Sales Representative 1978-05-29
6   Michael     Suyama      Sales Representative 1981-07-02
7     Janet  Leverling      Sales Representative 1981-08-30
8      Anne  Dodsworth      Sales Representative 1984-01-27

## 11. Showing Only the Date with a DateTime Field

In [29]:
sql("""
    SELECT FirstName, LastName, Title, CAST(BirthDate as DATE) AS BirthDate 
    FROM Employees
    ORDER BY BirthDate
""")

  FirstName   LastName                     Title   BirthDate
0  Margaret    Peacock      Sales Representative  1955-09-19
1     Nancy    Davolio      Sales Representative  1966-12-08
2    Andrew     Fuller     Vice President, Sales  1970-02-19
3    Steven   Buchanan             Sales Manager  1973-03-04
4     Laura   Callahan  Inside Sales Coordinator  1976-01-09
5    Robert       King      Sales Representative  1978-05-29
6   Michael     Suyama      Sales Representative  1981-07-02
7     Janet  Leverling      Sales Representative  1981-08-30
8      Anne  Dodsworth      Sales Representative  1984-01-27

## 12. Employees Full Name

In [30]:
sql("""
    SELECT FirstName,
           LastName,
           (FirstName + ' ' + LastName) AS FullName
    FROM Employees
""")

  FirstName   LastName          FullName
0     Nancy    Davolio     Nancy Davolio
1    Andrew     Fuller     Andrew Fuller
2     Janet  Leverling   Janet Leverling
3  Margaret    Peacock  Margaret Peacock
4    Steven   Buchanan   Steven Buchanan
5   Michael     Suyama    Michael Suyama
6    Robert       King       Robert King
7     Laura   Callahan    Laura Callahan
8      Anne  Dodsworth    Anne Dodsworth

- Or, it could be done with CONCAT operator like below.

In [31]:
sql("""
    SELECT FirstName,
           LastName,
           CONCAT(FirstName,' ',LastName) AS FullName
    FROM Employees
""")

  FirstName   LastName          FullName
0     Nancy    Davolio     Nancy Davolio
1    Andrew     Fuller     Andrew Fuller
2     Janet  Leverling   Janet Leverling
3  Margaret    Peacock  Margaret Peacock
4    Steven   Buchanan   Steven Buchanan
5   Michael     Suyama    Michael Suyama
6    Robert       King       Robert King
7     Laura   Callahan    Laura Callahan
8      Anne  Dodsworth    Anne Dodsworth

## 13. OrderDetails Amount per Line Item

In [32]:
sql("""
    SELECT OrderID,
           ProductID,
           UnitPrice,
           Quantity,
           UnitPrice * Quantity AS TotalPrice
    FROM OrderDetails
""")

      OrderID  ProductID  UnitPrice  Quantity  TotalPrice
0       10248         11      14.00        12       168.0
1       10248         42       9.80        10        98.0
2       10248         72      34.80         5       174.0
3       10249         14      18.60         9       167.4
4       10249         51      42.40        40      1696.0
...       ...        ...        ...       ...         ...
2150    11077         64      33.25         2        66.5
2151    11077         66      17.00         1        17.0
2152    11077         73      15.00         2        30.0
2153    11077         75       7.75         4        31.0
2154    11077         77      13.00         2        26.0

[2155 rows x 5 columns]

## 14. How Many Customers?

In [33]:
sql("""
    SELECT COUNT(*) AS TotalCustomers
    FROM Customers
""")

   TotalCustomers
0              91

## 15. When was the First Order?

In [40]:
sql("""
    SELECT MIN(OrderDate) AS FirstOrder
    FROM Orders
""")

           FirstOrder
0 2014-07-04 08:00:00

## 16. Countries Where There are Customers

In [41]:
sql("""
    SELECT DISTINCT(Country) AS Country
    FROM Customers
""")

        Country
0     Argentina
1       Austria
2       Belgium
3        Brazil
4        Canada
5       Denmark
6       Finland
7        France
8       Germany
9       Ireland
10        Italy
11       Mexico
12       Norway
13       Poland
14     Portugal
15        Spain
16       Sweden
17  Switzerland
18           UK
19          USA
20    Venezuela

- It could be done using GROUP BY statement, as the hint says

In [42]:
sql("""
    SELECT Country 
    FROM Customers
    GROUP BY Country
""")

        Country
0     Argentina
1       Austria
2       Belgium
3        Brazil
4        Canada
5       Denmark
6       Finland
7        France
8       Germany
9       Ireland
10        Italy
11       Mexico
12       Norway
13       Poland
14     Portugal
15        Spain
16       Sweden
17  Switzerland
18           UK
19          USA
20    Venezuela

## 17. Contact Titles for Customers

In [43]:
sql("""
    SELECT ContactTitle,
           COUNT(*) AS TotalContactTitle
    FROM Customers
    GROUP BY ContactTitle
    ORDER BY COUNT(*) DESC
""")

                      ContactTitle  TotalContactTitle
0                            Owner                 17
1             Sales Representative                 17
2                Marketing Manager                 12
3                    Sales Manager                 11
4               Accounting Manager                 10
5                  Sales Associate                  7
6              Marketing Assistant                  6
7                      Sales Agent                  5
8            Assistant Sales Agent                  2
9              Order Administrator                  2
10  Assistant Sales Representative                  1
11       Owner/Marketing Assistant                  1

## 18. Products with Associated Supplier Names

In [45]:
sql("""
    SELECT ProductID, ProductName, CompanyName
    FROM Products p
    JOIN Suppliers s
    ON p.SupplierID = s.SupplierID
    ORDER BY ProductID
""")

    ProductID                      ProductName  \
0           1                             Chai
1           2                            Chang
2           3                    Aniseed Syrup
3           4     Chef Anton's Cajun Seasoning
4           5           Chef Anton's Gumbo Mix
..        ...                              ...
72         73                       Röd Kaviar
73         74                    Longlife Tofu
74         75             Rhönbräu Klosterbier
75         76                     Lakkalikööri
76         77  Original Frankfurter grüne Soße

                          CompanyName
0                      Exotic Liquids
1                      Exotic Liquids
2                      Exotic Liquids
3          New Orleans Cajun Delights
4          New Orleans Cajun Delights
..                                ...
72                  Svensk Sjöföda AB
73                      Tokyo Traders
74  Plutzer Lebensmittelgroßmärkte AG
75                          Karkki Oy
76  Plutzer Lebensmittelgroßmärkte AG

[77 rows x 3 columns]

## 19. Orders and the Shippers That was Used

In [48]:
sql("""
    SELECT OrderID,
           CAST(OrderDate AS DATE) AS OrderDate,
           CompanyName AS Shipper
    FROM Orders o
    JOIN Shippers s
    ON o.ShipVia = s.ShipperID
    WHERE OrderID < 10270
""")

    OrderID   OrderDate           Shipper
0     10248  2014-07-04  Federal Shipping
1     10249  2014-07-05    Speedy Express
2     10250  2014-07-08    United Package
3     10251  2014-07-08    Speedy Express
4     10252  2014-07-09    United Package
5     10253  2014-07-10    United Package
6     10254  2014-07-11    United Package
7     10255  2014-07-12  Federal Shipping
8     10256  2014-07-15    United Package
9     10257  2014-07-16  Federal Shipping
10    10258  2014-07-17    Speedy Express
11    10259  2014-07-18  Federal Shipping
12    10260  2014-07-19    Speedy Express
13    10261  2014-07-19    United Package
14    10262  2014-07-22  Federal Shipping
15    10263  2014-07-23  Federal Shipping
16    10264  2014-07-24  Federal Shipping
17    10265  2014-07-25    Speedy Express
18    10266  2014-07-26  Federal Shipping
19    10267  2014-07-29    Speedy Express
20    10268  2014-07-30  Federal Shipping
21    10269  2014-07-31    Speedy Express